first_routes/app/controllers/users_controller.rb

    def create
        user = User.new(pass_params)
        #replace the `user_attributes_here` with the actual attribute keys
        if user.save
---
INSERT INTO "users" ("id", "name", "email") VALUES ($1, $2, $3) RETURNING "id"  [["id", 5], ["name", "Hello"], ["email", "kyy@ymail.com"]]

    def destroy
        # figure syntax
        user = User.find_by(id: :id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]